import React from 'react';
import {Cntr} from "./style";

const AboutPage = () => {
    return (
        <Cntr>
            <div>
                <h1>О нас</h1>
                <span>
                    Идея создания нашей команды возникла на почве желания помочь усовершенствовать бизнес-процессы наших текущих и потенциальных клиентов.
                    Наблюдая за работой персонала во многих компаниях самой различной направленности, невольно приходят мысли такого плана:
                    «Вот эту работу можно сделать не за 3 часа, а за 15 минут. А здесь нужно действовать совершенно по-другому. А в данном случае необходимо научить людей работать иначе».
                    Проблемой было всегда время — хотелось помочь всем и сразу, но иногда помогать нужно было, прежде всего себе. И тогда было решено собрать команду единомышленников,
                    порядочных людей, которым нравится их деятельность и которые хотят работать, прежде всего на результат, не жертвуя качеством. Воплощением этих мыслей стала компания с названием IT Spec.
                    Компания IT Spec начала свою работу  в 2014 году и на сегодняшний день нашими основными направлениями являются:
            </span>
                <li>Внедрение и сопровождение продуктов 1С:Підприємство</li>
                <li>Анализ и консультирование по автоматизации предприятий</li>
                <li>Администрирование серверов и рабочих станций</li>
                <li>Установка систем видеонаблюдения</li>
                <li>Установка систем идентификации и контроля рабочего времени персонала</li>
                <li>Внедрение корпоративных порталов Битрикс24</li>
                <li>GPS контроль транспорта и топлива</li>
                <li>Разработка веб-сайтов</li>
            </div>
            <div>
                <h2>Наша философия</h2>
                <span>Чтобы лучше понять, что мы за люди и как стараемся работать, возможно, лучшим вариантом будет привести такие тезисы, которых мы стараемся придерживаться:</span>
                <li>Нет ничего более постоянного, чем временное — лучше сразу сделать так, как надо.</li>
                <li>Нет компромиссам — в сложных и нестандартных ситуациях не стоит идти на сделку с совестью. Всегда
                    стоит обдумать все возможные варианты и найти решение.
                </li>
                <li>Поставь себя на место клиента, представь, что компания, с которой ты работаешь — это твоя компания,
                    и продумай где и как можно применить знания IT технологий.
                </li>
                <li>Нет ничего более приятного в профессиональной деятельности, чем наблюдать положительный результат
                    работы в компании клиента. Это — первая и самая важная причина работать. Этим мы отличаемся от
                    многих компаний, которые ставят на первое место деньги.
                </li>
                <li>Каждый новый проект — это стремление сделать еще чуточку лучше, чем в предыдущем. Развитие самих
                    себя и компании в целом — это то, что нам приносит удовольствие.
                </li>
                <li>Все совершают ошибки, разница только в их частоте — кто-то допускает их больше, кто-то меньше. Мы
                    очень беспокоимся о том, что бы их было минимальное количество, потому в своей работе полагаемся не
                    только на свои знания, но и на знания и опыт наших партнеров или поставщиков.
                </li>
            </div>
        </Cntr>
    );
};

export default AboutPage;
